sample_app/app/controllers/microposts_controller.rb

INSERT INTO `microposts` (`content`, `created_at`, `updated_at`, `user_id`) VALUES ('I like this app.', '2013-08-01 09:55:02', '2013-08-01 09:55:02', 1)
---
   def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save

DELETE FROM `microposts` WHERE `microposts`.`id` = 295
---
   def destroy
    @micropost.destroy