sample_app/app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0
---
  def index
   @users = User.paginate(page: params[:page])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY created_at DESC LIMIT 30 OFFSET 0
---
   def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `remember_token`, `updated_at`) VALUES ('2013-07-30 17:47:11', 'gourav@gmail.com', 'Gourav .', '$2a$10$FIa8iC/ZAkrmDmUMHr.Wd.GKwbb5WQeGoBMm2CcAZDZNQ6sucYLLa', 'd0334ce68004c8b0a5c6c072202683aef3f881f2', '2013-07-30 17:47:11')
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE `users` SET `name` = 'Rails Tutorial1', `email` = 'gourav1@railstutorial.org', `password_digest` = '$2a$10$bY1SoSRwWOYgWXx/npvH/.v0SIeGZneoW1Cv4jPBTH8zs0viGFPTi', `updated_at` = '2013-07-31 15:38:48' WHERE `users`.`id` = 2
---
  def update
  #  @user = User.find(params[:id])
    if @user.update_attributes(user_params)